{
  "backend/main.mo": "Main canister actor defining card metadata types, access control, storage mixins, and endpoints for card operations including add and transform.",
  "backend/migration.mo": "Migration module converting old card records to the new format by adding a default team field and returning updated actor state.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test references for Brewers card catalog enhancements.",
  "frontend-file-summaries.txt": "Prewritten summary file mapping frontend source paths to concise descriptions of each component or page.",
  "frontend/index.css": "Global Tailwind-based style definitions using OKLCH colors and theme variables for light and dark modes.",
  "frontend/index.html": "HTML entry point defining root element, Brewers favicon, metadata, and loading the main React script.",
  "frontend/src/App.tsx": "Application root configuring routes, layout, theming, and admin-protected import page.",
  "frontend/src/components/AddCardDialog.tsx": "Dialog component for adding new cards via image recognition or manual entry, defaulting team to Milwaukee Brewers.",
  "frontend/src/components/AddWishlistDialog.tsx": "Placeholder file with no implemented content.",
  "frontend/src/components/AdminRouteGuard.tsx": "Guards routes by checking authentication and admin status, showing loading, login, or access denied screens before rendering children.",
  "frontend/src/components/CameraCapture.tsx": "Provides camera capture UI with support checks, switching cameras, error handling, and returning a captured photo file.",
  "frontend/src/components/CardDetailDialog.tsx": "Displays a detailed card dialog with tabs, price refresh, editing, and deletion actions using card metadata.",
  "frontend/src/components/CardGrid.tsx": "Renders a grid of card items and opens a detail dialog when a card is selected.",
  "frontend/src/components/CardItem.tsx": "Shows a card preview with image, metadata, and price, highlighting AI-recognized cards.",
  "frontend/src/components/EditCardDialog.tsx": "Dialog for editing card data, including metadata fields and optional image upload with progress tracking.",
  "frontend/src/components/EditWishlistDialog.tsx": "Empty file with no implementation.",
  "frontend/src/components/FilterSidebar.tsx": "Sidebar providing search and filter controls derived from loaded cards, with reset and active filter indicators.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Navigation header with branding, admin import button, and login/logout handling via Internet Identity.",
  "frontend/src/components/ImageRecognitionForm.tsx": "Form that uploads or captures an image, runs card recognition, and populates fields with confidence indicators before submitting.",
  "frontend/src/components/ManualCardForm.tsx": "Manual entry form for creating a card with required fields, image upload, validation, and progress‑tracked upload.",
  "frontend/src/components/MoveToCollectionDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/PriceHistoryChart.tsx": "Displays a card’s price history using a Recharts line chart with loading and empty‑state handling.",
  "frontend/src/components/ValueTrendsSummary.tsx": "Summarizes recent price changes across cards, showing top movers with percent change indicators.",
  "frontend/src/components/WishlistDetailDialog.tsx": "Empty placeholder component file.",
  "frontend/src/components/WishlistGrid.tsx": "Empty placeholder component file.",
  "frontend/src/components/WishlistItemCard.tsx": "Empty placeholder component file.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling login, stored‑identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating card data, user profiles, and admin state using an actor API.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with Brewers-themed color tokens.",
  "frontend/src/lib/cardRecognition.ts": "Implements multi-stage card recognition with mocked primary and fallback OCR methods, returning confidence-scored metadata.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClient and InternetIdentity providers and mounts the root component.",
  "frontend/src/pages/CardCatalog.tsx": "Renders the card catalog with filters, search, pagination, value summary, and an add-card dialog.",
  "frontend/src/pages/ImportPage.tsx": "Handles CSV and image-based bulk card import with parsing, upload progress, and error reporting.",
  "frontend/src/pages/WishlistPage.tsx": "Empty page placeholder for wishlist functionality.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, persisting, and clearing URL and session parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, scanning source files, and extending theme tokens for colors, layout, shadows, and animations. It imports typography, container-queries, and animation plugins.",
  "project_state.json": "Defines the project’s state, schema version, goals, existing features, and architectural notes for building a Brewers card database with search and bulk import workflows."
}