{
  "kind": "build_request",
  "title": "Bulk import Milwaukee Brewers card images and make a scalable searchable card database",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a backend data field to explicitly label each card’s team and support filtering/searching for a Milwaukee Brewers-only catalog.\n\n- Extend CardMetadata with a required `team : Text` field.\n- Extend CardFilters with optional `team : ?Text`.\n- Update addCard/updateCard/filterCards (and any other relevant query) to store and filter by team.\n- Default team to \"Milwaukee Brewers\" for any existing card records during upgrade so existing data remains readable.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Import pictures of all Milwaukee brewers cards made and make a searchable database"
        ]
      },
      "acceptanceCriteria": [
        "Cards stored in the backend include a non-empty `team` field.",
        "Filtering by `team = \"Milwaukee Brewers\"` returns only Brewers-labeled cards.",
        "Existing cards created before this change still load without errors and have team set to \"Milwaukee Brewers\" after upgrade."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement paginated, server-side searchable queries for cards so the database remains usable when many Brewers cards are imported.\n\n- Add a query method that supports pagination (page size + cursor/offset) and accepts CardFilters plus a free-text search term.\n- Return both the page of cards and a next-cursor/hasMore indicator.\n- Ensure the query can filter by year, playerName, brand, cardSeries, isRookieCard, isAutographed, and team, and can also apply a free-text search across playerName/brand/cardSeries (case-insensitive).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Import pictures of all Milwaukee brewers cards made and make a searchable database"
        ]
      },
      "acceptanceCriteria": [
        "A client can request the first N cards and then request the next page using the returned cursor/offset.",
        "Server-side filtering + free-text search works in combination (e.g., team=Brewers + year + search term).",
        "The frontend is able to load large datasets without calling `getAllCards()` for initial render."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an admin-only bulk import workflow to ingest a large Milwaukee Brewers card dataset with images.\n\nFrontend:\n- Add a new page/route accessible from the UI (e.g., \"Import\") that lets an authenticated admin upload:\n  1) A CSV file containing card metadata (at minimum: id, year, playerName, brand; optional: serialNumber, cardNumber, cardSeries, notes, isRookieCard, isAutographed, team).\n  2) A ZIP (or multiple files) of card images whose filenames map to CSV rows (e.g., by id).\n- Provide a CSV template download and clear instructions (English).\n- Show import progress, counts (created/updated/failed), and a downloadable error report for failed rows.\n\nBackend:\n- Add an admin-restricted endpoint to bulk upsert cards (create if missing, update if exists) and store associated images using the existing blob storage approach.\n- Enforce that non-admin users cannot perform bulk imports.\n- If team is missing in the CSV, set it to \"Milwaukee Brewers\" during import.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Import pictures of all Milwaukee brewers cards made and make a searchable database"
        ]
      },
      "acceptanceCriteria": [
        "An admin can import a CSV + images and see newly imported cards appear in the catalog with their images.",
        "Rows with invalid data are skipped with a clear per-row error message; successful rows still import.",
        "Non-admin users cannot access or execute the bulk import operation (backend rejects the call).",
        "If the CSV does not specify team, imported cards are saved with team = \"Milwaukee Brewers\"."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Update the card catalog UI to behave as a searchable database for Milwaukee Brewers cards and to use the new server-side pagination/search.\n\n- Replace the current \"load everything then filter in-memory\" approach with React Query calls to the new paginated backend query.\n- Keep the existing filter controls (search, year, series, brand, player, rookie, autographed) but apply them by requesting filtered pages from the backend.\n- Add a team filter defaulted to \"Milwaukee Brewers\" and keep it fixed/hidden unless explicitly changed (so the app remains Brewers-focused).\n- Add pagination controls (Next/Previous or infinite load-more) and display the total number of results currently loaded plus a \"Loading more…\" state.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8"
        ],
        "quotes": [
          "Import pictures of all Milwaukee brewers cards made and make a searchable database"
        ]
      },
      "acceptanceCriteria": [
        "The catalog page can browse results beyond the first page without loading all cards at once.",
        "Changing any filter triggers a new paginated query rather than filtering an already-loaded full dataset.",
        "By default, the catalog shows only cards with team \"Milwaukee Brewers\".",
        "All user-facing text for the updated catalog and pagination is in English."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; add migration.mo only if required to preserve/upgrade existing state.",
    "Do not edit any files under frontend/src/components/ui or other frontend immutablePaths defined in SYSTEM_CONTEXT; compose existing UI components instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Automatically sourcing or scraping \"all Milwaukee Brewers cards ever made\" from third-party sites/APIs (no external dataset/source was provided).",
    "Integrating external databases or non-Internet-Computer backend services.",
    "Adding third-party authentication providers (Internet Identity only)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}